// ConsoleApplication1.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include "voisk.h"
#include <thread>
using namespace std;
void comand(Voisk& voi, bool por)
{
    voi.print();
    voi.sort(por);
    voi.print();
}
void war(Voisk& voi1, Voisk& voi2)
{
    if (&voi1 > &voi2)
    {
        voi1.getLock();
        voi2.getLock();
    }
    else
    {
        voi2.getLock();
        voi1.getLock();
    }
    
    voi1.fight(voi2);
}
int main()
{
    Voisk test(6,7);
    Voisk test1(6, 7);
    thread t1(war, ref(test), ref(test1));
    thread t2(war, ref(test1), ref(test));
    t1.join();
    t2.join();
    test.print();
    std::cout << "Hello World!\n";
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
